app/controllers/api/v1/skills_controller.rb

SELECT  "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_skill
        @skill = Skill.find(params[:id])