app/controllers/api/v1/skills_controller.rb

    def index
        skills = Skill.all
---
SELECT "skills".* FROM "skills"

    def show
        skill = Skill.find(params[:id])
---
SELECT  "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create
        skill = Skill.new(skill_params)
            if skill.save
---
INSERT INTO "skills" ("name", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"