app/controllers/api/v1/tasks_controller.rb

        task = Task.new(tasks_params)
            if task.save
---
INSERT INTO "tasks" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "Cook chicken and rice"], ["created_at", "2021-12-21 08:11:08.111930"], ["updated_at", "2021-12-21 08:11:08.111930"]]