app/controllers/api/v1/tasks_controller.rb

def index
    tasks = Task.all
---
SELECT "tasks".* FROM "tasks"

        task = Task.new(task_params)
            if task.save
---
INSERT INTO "tasks" ("description", "created_at", "updated_at", "skill_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "Sing"], ["created_at", "2021-12-30 10:00:55.260657"], ["updated_at", "2021-12-30 10:00:55.260657"], ["skill_id", 1]]